testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/5/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 62.67ms, 159.56 req/s, 152.22MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 320 sent, 8242 received
                     min         max         mean         sd        +/- sd
time for request:    32.40ms     55.17ms     44.39ms      8.17ms    60.00%
time for connect:     4.47ms     26.15ms     14.80ms      7.28ms    60.00%
time to 1st byte:    25.62ms     28.12ms     26.71ms       984us    50.00%
req/s           :      16.18       17.37       16.87        0.45    50.00%